#include <table.h>

/*
main принимает ввод команд для баз данных в папке data (см. README)

TODO:
    Создавать необходимую таблицу при CREATE TABLE (при этом возможно понадобится проверка на существование, кроме той, что  в file_manager.cpp::create_table)
    Настроить парсинг команд и согласовать их правильную передачу в таблицу
    Подумать над форматом condition в table.h (договориться с ответственным за Table)
    При этом может понадобится изменение каких-то сигнатур функций, не забываем общаться...
*/

int main() {
    return 0;
}